In [7]:
import numpy as np
import pandas as pd 
from datetime import datetime

In [11]:
pd.to_datetime(dt[0],dayfirst=False)

Timestamp('2000-11-03 00:00:00')

In [9]:
dt = pd.Series(["Nov 3,2000","2000-01-01",None])
dt

0    Nov 3,2000
1    2000-01-01
2          None
dtype: object

In [33]:
pd.to_datetime("20111012",format="%Y%m%d")

Timestamp('2011-10-12 00:00:00')

In [34]:
year = 2020
month =  7
day = 5
hour = 18
minute = 45
second = 22

In [35]:
my_date = datetime(year, month,day)

In [36]:
my_date

datetime.datetime(2020, 7, 5, 0, 0)

In [37]:
type(my_date)

datetime.datetime

In [38]:
my_date_hour = datetime(year,month,day,hour,minute,second)

In [39]:
my_date.day

5

In [41]:
my = datetime(2020,12,3,7,4,10)

In [42]:
my.day

3

In [43]:
dt = pd.Series(['Nov 3, 2000', '2000-01-01', None])
dt

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [44]:
my_date.date()

datetime.date(2020, 7, 5)

In [46]:
my_date_hour.time()

datetime.time(18, 45, 22)

In [47]:
pd.to_datetime(dt)

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [52]:
pd.to_datetime(214234555435514412)

Timestamp('1976-10-15 13:35:55.435514412')

In [55]:
pd.to_datetime("11-05-2020",dayfirst=True),pd.to_datetime("11-05-2020",dayfirst=False)

(Timestamp('2020-05-11 00:00:00'), Timestamp('2020-11-05 00:00:00'))

In [57]:
pd.to_datetime("12--10--2020")

Timestamp('2020-12-10 00:00:00')

In [59]:
pd.to_datetime("12-Oct-2020")

Timestamp('2020-10-12 00:00:00')

In [63]:
pd.to_datetime("12--Oct---2020",format="%d--%b---%Y")

Timestamp('2020-10-12 00:00:00')

In [79]:
strange_date = "   5th   of Oct 2000   \n\t"

In [80]:
pd.to_datetime(strange_date)

Timestamp('2000-10-05 00:00:00')

In [81]:
df_currency = pd.read_csv("../../Downloads/currency_rates_082020_EUR.csv")

In [82]:
df_currency.head()

  currency      date  rate
0      EUR  8/1/2020   1.0
1      EUR  8/2/2020   1.0
2      EUR  8/3/2020   1.0
3      EUR  8/4/2020   1.0
4      EUR  8/5/2020   1.0

In [108]:
df_currency["date2"] = pd.to_datetime(df_currency["date"])

In [110]:
df_currency.head()

  currency      date  rate      date2
0      EUR  8/1/2020   1.0 2020-08-01
1      EUR  8/2/2020   1.0 2020-08-02
2      EUR  8/3/2020   1.0 2020-08-03
3      EUR  8/4/2020   1.0 2020-08-04
4      EUR  8/5/2020   1.0 2020-08-05

In [116]:
df_currency["date2"][9]-df_currency["date2"][0]

Timedelta('9 days 00:00:00')

In [99]:
df_currency["date2"][200]

Timestamp('2020-08-01 00:00:00')

In [101]:
df_currency.loc[200]

currency                    CZK
date                   8/1/2020
rate                     26.241
date2       2020-08-01 00:00:00
Name: 200, dtype: object

In [117]:
df_currency.head()

  currency      date  rate      date2
0      EUR  8/1/2020   1.0 2020-08-01
1      EUR  8/2/2020   1.0 2020-08-02
2      EUR  8/3/2020   1.0 2020-08-03
3      EUR  8/4/2020   1.0 2020-08-04
4      EUR  8/5/2020   1.0 2020-08-05

In [118]:
df = df_currency

In [121]:
df[df["currency"] == "GBP"].iloc[9,2:] - df[df["currency"] == "GBP"].iloc[4,2:]

rate            -0.00675
date2    5 days 00:00:00
dtype: object

In [146]:
sales = pd.read_csv("../../Downloads/RetailSales_BeerWineLiquor.csv",parse_dates=[0])

In [144]:
df["date2"].dt.is_leap_year

0      True
1      True
2      True
3      True
4      True
       ...
215    True
216    True
217    True
218    True
219    True
Name: date2, Length: 220, dtype: bool

In [128]:
df.head()

  currency      date  rate      date2
0      EUR  8/1/2020   1.0 2020-08-01
1      EUR  8/2/2020   1.0 2020-08-02
2      EUR  8/3/2020   1.0 2020-08-03
3      EUR  8/4/2020   1.0 2020-08-04
4      EUR  8/5/2020   1.0 2020-08-05

In [131]:
df["date2"].dt.day_name().value_counts()

Saturday     44
Sunday       44
Monday       44
Tuesday      22
Wednesday    22
Thursday     22
Friday       22
Name: date2, dtype: int64

In [147]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [148]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [ ]:
sales["DATE"]

In [151]:
sales = sales.set_index("DATE")

In [152]:
sales.resample(rule="A").mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [153]:
sales.resample(rule="W").mean()

            MRTSSM4453USN
DATE
1992-01-05         1509.0
1992-01-12            NaN
1992-01-19            NaN
1992-01-26            NaN
1992-02-02         1541.0
...                   ...
2020-03-08            NaN
2020-03-15            NaN
2020-03-22            NaN
2020-03-29            NaN
2020-04-05         5207.0

[1475 rows x 1 columns]

In [154]:
sales.resample(rule="SMS").mean()

            MRTSSM4453USN
DATE
1992-01-01         1509.0
1992-01-15            NaN
1992-02-01         1541.0
1992-02-15            NaN
1992-03-01         1597.0
...                   ...
2020-02-01         4533.0
2020-02-15            NaN
2020-03-01         5562.0
2020-03-15            NaN
2020-04-01         5207.0

[679 rows x 1 columns]

In [155]:
sales[:50]

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
1992-06-01           1775
1992-07-01           1912
1992-08-01           1862
1992-09-01           1770
1992-10-01           1882
1992-11-01           1831
1992-12-01           2511
1993-01-01           1614
1993-02-01           1529
1993-03-01           1678
1993-04-01           1713
1993-05-01           1796
1993-06-01           1792
1993-07-01           1950
1993-08-01           1777
1993-09-01           1707
1993-10-01           1757
1993-11-01           1782
1993-12-01           2443
1994-01-01           1548
1994-02-01           1505
1994-03-01           1714
1994-04-01           1757
1994-05-01           1830
1994-06-01           1857
1994-07-01           1981
1994-08-01           1858
1994-09-01           1823
1994-10-01           1806
1994-11-01           1845
1994-12-01           2577
1995-01-01           1555
1995-02-01           1501
1995-03-01           1725
1995-04-01           1699
1995-05-01           1807
1995-06-01           1863
1995-07-01           1886
1995-08-01           1861
1995-09-01           1845
1995-10-01           1788
1995-11-01           1879
1995-12-01           2598
1996-01-01           1679
1996-02-01           1652